Revit 2024 API
IndependentTag.HasTagBehavior Method
 Checks if the IndependentTag has a tag behavior.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public bool HasTagBehavior()
Visual Basic
Public Function HasTagBehavior As Boolean
Visual C++
public:
bool HasTagBehavior()
Remarks
 When the IndependentTag object does not have a tag behavior, functions related to references, leaders and orientation will throw an exception. In this case, the element may be used for geometry augmentation. [!:Autodesk::Revit::Proxy::DB::IGeometryAugmentationServer] The list of functions that would fail if not in tag mode: [M:Autodesk.Revit.DB.IndependentTag.AddReferences(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Reference})]GetLeaderElbow(Reference)GetLeaderEnd(Reference)HasLeaderHasLeaderElbow(Reference)IsLeaderVisible(Reference)LeaderEndConditionLeadersPresentationModeMergeElbows[M:Autodesk.Revit.DB.IndependentTag.RemoveReferences(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Reference})]SetIsLeaderVisible(Reference, Boolean)SetLeaderEnd(Reference, XYZ)SetLeaderElbow(Reference, XYZ)TagOrientationTagText
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace